eisup_2019_docmng_integration/src/Catalogs/ttk_СтатьиЗатратВГО/ttk_СтатьиЗатратВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ttk_СтатьиЗатратВГО</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КодАСВГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовСтатейЗатрат/абс_ИзменениеСтатусовСтатейЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовСтатейЗатрат</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.ttk_СтатьиЗатратВГО</types>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусСтатьиЗатрат</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНоменклатуры/абс_СтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНоменклатуры</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласование</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ttk_СтатьиЗатратВГО/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыНоменклатуры.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ДатаСеанса = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовСтатейЗатрат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
	НаборЗаписей.Отбор.СтатьяЗатрат.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ДатаСеанса;
	Запись.СтатьяЗатрат = Ссылка;
	Запись.Исполнитель = ТекПользователь;	
	Запись.СтатусСтатьиЗатрат = Статус;	
	Запись.Комментарий = ПричинаИзмененияСтатуса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.абс_СтатусыНоменклатуры.Подготовка;
	Комментарий = "";
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры
